tests/fixtures/requests/serverCompletePurchase.xml

<?xml version="1.0" encoding="utf-8"?>
<order type="card" id="99999" timestamp="20170820202538"><signature>MT3J-BLPQ-E2XF-HFHX-FHCT</signature><invoice currency="RON" amount="20.00" installments="2,3"><details><![CDATA[Comanda]]></details><contact_info><billing type="person"><first_name><![CDATA[Gabriel]]></first_name><last_name><![CDATA[Solomon]]></last_name><address><![CDATA[+]]></address></billing><shipping type="person"><first_name><![CDATA[Gabriel]]></first_name><last_name><![CDATA[Solomon]]></last_name><address><![CDATA[+]]></address></shipping></contact_info></invoice><url><return>http://www.site_propriu.com/return</return><confirm>http://www.site_propriu.com/return</confirm></url><mobilpay timestamp="20170821180018" crc="5adc97ca3bf455e2538951822fa49f13"><action>confirmed</action><customer type="person"><first_name><![CDATA[Gabriel]]></first_name><last_name><![CDATA[Solomon]]></last_name><address><![CDATA[Bacau]]></address><email><![CDATA[solomongaby%40gmail.com]]></email><mobile_phone><![CDATA[%2B0741040219]]></mobile_phone></customer><purchase>488101</purchase><original_amount>20.00</original_amount><processed_amount>20.00</processed_amount><current_payment_count>1</current_payment_count><pan_masked>9****5098</pan_masked><rrn>9991503</rrn><payment_instrument_id>17171</payment_instrument_id><installments>1</installments><error code="0"><![CDATA[Tranzactia aprobata]]></error></mobilpay></order>
